tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/services'
tap 'thoughtbot/formulae'

brew 'aspell'
brew 'awscli'
brew 'bat'
brew 'colordiff'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'diffutils'
brew 'exa'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'gnu-sed'
brew 'gpg2'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'moreutils'
brew 'nmap'
brew 'pandoc'
brew 'php-cs-fixer'
brew 'postgresql', restart_service: :changed
brew 'rbenv'
brew 'rcm'
brew 'ripgrep'
brew 'rsync'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vagrant-completion'
brew 'vim'
brew 'vips'
brew 'wget'
brew 'yarn'
brew 'zplug'

tap 'homebrew/cask'
cask_args appdir: '/usr/local/bin'

cask 'michaelvillar-timer', args: { appdir: '/Applications' }
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'rectangle', args: { appdir: '/Applications' }
cask 'suspicious-package'
cask 'vagrant'
cask 'wkhtmltopdf'

# vim:ft=ruby
