tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'teamookla/speedtest'
tap 'thoughtbot/formulae'

brew 'aspell'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'cmatrix'
brew 'colordiff'
brew 'composer'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'curl'
brew 'diffutils'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'gpg2'
brew 'grep'
brew 'gzip'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'make'
brew 'mas'
brew 'moreutils'
brew 'neofetch'
brew 'nmap'
brew 'pandoc'
brew 'ponysay'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'rcm'
brew 'ripgrep'
brew 'rsync'
brew 'ruby-build'
brew 'showkey'
brew 'speedtest'
brew 'svn'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vagrant-completion'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zsh'

# Applications and utilities
# Alacritty must be built from source until the next release (v0.10 or later)
# https://github.com/alacritty/alacritty/issues/5584
# cask 'alacritty'
cask 'bartender'
cask 'bluejeans'
cask 'chromium'
cask 'docker'
cask 'firefox-developer-edition'
cask 'inkscape'
cask 'istat-menus'
cask 'keepingyouawake'
cask 'keyboard-maestro'
cask 'libreoffice'
cask 'mailmate'
cask 'michaelvillar-timer'
cask 'recordit'
cask 'rectangle'
cask 'vagrant'
cask 'vlc'
cask 'wkhtmltopdf'
cask 'zoom'

# QuickLook plugins
cask 'apparency'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'suspicious-package'

# Fonts
cask 'font-cousine'
cask 'font-cousine-nerd-font'
cask 'font-fontawesome'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ubuntu'
cask 'font-ubuntu-mono'

# App store
mas '1Password 7 - Password Manager', id: 1333542190
mas 'CARROT Weather', id: 993487541
mas 'Exporter', id: 1099120373
mas 'Pixelmator Pro', id: 1289583905
mas 'Slack for Desktop', id: 803453959
